MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2580/mcu.h
// Register: B1D0
#define B1D0 B1D0
extern volatile unsigned char           B1D0                __at(0xE36);
#ifndef _LIB_BUILD
asm("B1D0 equ 0E36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D00                  :1;
        unsigned B1D01                  :1;
        unsigned B1D02                  :1;
        unsigned B1D03                  :1;
        unsigned B1D04                  :1;
        unsigned B1D05                  :1;
        unsigned B1D06                  :1;
        unsigned B1D07                  :1;
    };
} B1D0bits_t;
extern volatile B1D0bits_t B1D0bits __at(0xE36);
// bitfield macros
#define _B1D0_B1D00_POSN                                    0x0
#define _B1D0_B1D00_POSITION                                0x0
#define _B1D0_B1D00_SIZE                                    0x1
#define _B1D0_B1D00_LENGTH                                  0x1
#define _B1D0_B1D00_MASK                                    0x1
#define _B1D0_B1D01_POSN                                    0x1
#define _B1D0_B1D01_POSITION                                0x1
#define _B1D0_B1D01_SIZE                                    0x1
#define _B1D0_B1D01_LENGTH                                  0x1
#define _B1D0_B1D01_MASK                                    0x2
#define _B1D0_B1D02_POSN                                    0x2
#define _B1D0_B1D02_POSITION                                0x2
#define _B1D0_B1D02_SIZE                                    0x1
#define _B1D0_B1D02_LENGTH                                  0x1
#define _B1D0_B1D02_MASK                                    0x4
#define _B1D0_B1D03_POSN                                    0x3
#define _B1D0_B1D03_POSITION                                0x3
#define _B1D0_B1D03_SIZE                                    0x1
#define _B1D0_B1D03_LENGTH                                  0x1
#define _B1D0_B1D03_MASK                                    0x8
#define _B1D0_B1D04_POSN                                    0x4
#define _B1D0_B1D04_POSITION                                0x4
#define _B1D0_B1D04_SIZE                                    0x1
#define _B1D0_B1D04_LENGTH                                  0x1
#define _B1D0_B1D04_MASK                                    0x10
#define _B1D0_B1D05_POSN                                    0x5
#define _B1D0_B1D05_POSITION                                0x5
#define _B1D0_B1D05_SIZE                                    0x1
#define _B1D0_B1D05_LENGTH                                  0x1
#define _B1D0_B1D05_MASK                                    0x20
#define _B1D0_B1D06_POSN                                    0x6
#define _B1D0_B1D06_POSITION                                0x6
#define _B1D0_B1D06_SIZE                                    0x1
#define _B1D0_B1D06_LENGTH                                  0x1
#define _B1D0_B1D06_MASK                                    0x40
#define _B1D0_B1D07_POSN                                    0x7
#define _B1D0_B1D07_POSITION                                0x7
#define _B1D0_B1D07_SIZE                                    0x1
#define _B1D0_B1D07_LENGTH                                  0x1
#define _B1D0_B1D07_MASK                                    0x80

// Register: B1D1
#define B1D1 B1D1
extern volatile unsigned char           B1D1                __at(0xE37);
#ifndef _LIB_BUILD
asm("B1D1 equ 0E37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D10                  :1;
        unsigned B1D11                  :1;
        unsigned B1D12                  :1;
        unsigned B1D13                  :1;
        unsigned B1D14                  :1;
        unsigned B1D15                  :1;
        unsigned B1D16                  :1;
        unsigned B1D17                  :1;
    };
} B1D1bits_t;
extern volatile B1D1bits_t B1D1bits __at(0xE37);
// bitfield macros
#define _B1D1_B1D10_POSN                                    0x0
#define _B1D1_B1D10_POSITION                                0x0
#define _B1D1_B1D10_SIZE                                    0x1
#define _B1D1_B1D10_LENGTH                                  0x1
#define _B1D1_B1D10_MASK                                    0x1
#define _B1D1_B1D11_POSN                                    0x1
#define _B1D1_B1D11_POSITION                                0x1
#define _B1D1_B1D11_SIZE                                    0x1
#define _B1D1_B1D11_LENGTH                                  0x1
#define _B1D1_B1D11_MASK                                    0x2
#define _B1D1_B1D12_POSN                                    0x2
#define _B1D1_B1D12_POSITION                                0x2
#define _B1D1_B1D12_SIZE                                    0x1
#define _B1D1_B1D12_LENGTH                                  0x1
#define _B1D1_B1D12_MASK                                    0x4
#define _B1D1_B1D13_POSN                                    0x3
#define _B1D1_B1D13_POSITION                                0x3
#define _B1D1_B1D13_SIZE                                    0x1
#define _B1D1_B1D13_LENGTH                                  0x1
#define _B1D1_B1D13_MASK                                    0x8
#define _B1D1_B1D14_POSN                                    0x4
#define _B1D1_B1D14_POSITION                                0x4
#define _B1D1_B1D14_SIZE                                    0x1
#define _B1D1_B1D14_LENGTH                                  0x1
#define _B1D1_B1D14_MASK                                    0x10
#define _B1D1_B1D15_POSN                                    0x5
#define _B1D1_B1D15_POSITION                                0x5
#define _B1D1_B1D15_SIZE                                    0x1
#define _B1D1_B1D15_LENGTH                                  0x1
#define _B1D1_B1D15_MASK                                    0x20
#define _B1D1_B1D16_POSN                                    0x6
#define _B1D1_B1D16_POSITION                                0x6
#define _B1D1_B1D16_SIZE                                    0x1
#define _B1D1_B1D16_LENGTH                                  0x1
#define _B1D1_B1D16_MASK                                    0x40
#define _B1D1_B1D17_POSN                                    0x7
#define _B1D1_B1D17_POSITION                                0x7
#define _B1D1_B1D17_SIZE                                    0x1
#define _B1D1_B1D17_LENGTH                                  0x1
#define _B1D1_B1D17_MASK                                    0x80

