MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2580/mcu.h
extern volatile B5DLCbits_t B5DLCbits __at(0xE75);
// bitfield macros
#define _B5DLC_DLC0_POSN                                    0x0
#define _B5DLC_DLC0_POSITION                                0x0
#define _B5DLC_DLC0_SIZE                                    0x1
#define _B5DLC_DLC0_LENGTH                                  0x1
#define _B5DLC_DLC0_MASK                                    0x1
#define _B5DLC_DLC1_POSN                                    0x1
#define _B5DLC_DLC1_POSITION                                0x1
#define _B5DLC_DLC1_SIZE                                    0x1
#define _B5DLC_DLC1_LENGTH                                  0x1
#define _B5DLC_DLC1_MASK                                    0x2
#define _B5DLC_DLC2_POSN                                    0x2
#define _B5DLC_DLC2_POSITION                                0x2
#define _B5DLC_DLC2_SIZE                                    0x1
#define _B5DLC_DLC2_LENGTH                                  0x1
#define _B5DLC_DLC2_MASK                                    0x4
#define _B5DLC_DLC3_POSN                                    0x3
#define _B5DLC_DLC3_POSITION                                0x3
#define _B5DLC_DLC3_SIZE                                    0x1
#define _B5DLC_DLC3_LENGTH                                  0x1
#define _B5DLC_DLC3_MASK                                    0x8
#define _B5DLC_RB0_POSN                                     0x4
#define _B5DLC_RB0_POSITION                                 0x4
#define _B5DLC_RB0_SIZE                                     0x1
#define _B5DLC_RB0_LENGTH                                   0x1
#define _B5DLC_RB0_MASK                                     0x10
#define _B5DLC_RB1_POSN                                     0x5
#define _B5DLC_RB1_POSITION                                 0x5
#define _B5DLC_RB1_SIZE                                     0x1
#define _B5DLC_RB1_LENGTH                                   0x1
#define _B5DLC_RB1_MASK                                     0x20
#define _B5DLC_RXRTR_TXRTR_POSN                             0x6
#define _B5DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B5DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B5DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B5DLC_RXRTR_TXRTR_MASK                             0x40
#define _B5DLC_RESRB0_POSN                                  0x4
#define _B5DLC_RESRB0_POSITION                              0x4
#define _B5DLC_RESRB0_SIZE                                  0x1
#define _B5DLC_RESRB0_LENGTH                                0x1
#define _B5DLC_RESRB0_MASK                                  0x10
#define _B5DLC_RESRB1_POSN                                  0x5
#define _B5DLC_RESRB1_POSITION                              0x5
#define _B5DLC_RESRB1_SIZE                                  0x1
#define _B5DLC_RESRB1_LENGTH                                0x1
#define _B5DLC_RESRB1_MASK                                  0x20
#define _B5DLC_RXRTR_POSN                                   0x6
#define _B5DLC_RXRTR_POSITION                               0x6
#define _B5DLC_RXRTR_SIZE                                   0x1
#define _B5DLC_RXRTR_LENGTH                                 0x1
#define _B5DLC_RXRTR_MASK                                   0x40
#define _B5DLC_B5DLC0_POSN                                  0x0
#define _B5DLC_B5DLC0_POSITION                              0x0
#define _B5DLC_B5DLC0_SIZE                                  0x1
#define _B5DLC_B5DLC0_LENGTH                                0x1
#define _B5DLC_B5DLC0_MASK                                  0x1
#define _B5DLC_B5DLC1_POSN                                  0x1
#define _B5DLC_B5DLC1_POSITION                              0x1
#define _B5DLC_B5DLC1_SIZE                                  0x1
#define _B5DLC_B5DLC1_LENGTH                                0x1
#define _B5DLC_B5DLC1_MASK                                  0x2
#define _B5DLC_B5DLC2_POSN                                  0x2
#define _B5DLC_B5DLC2_POSITION                              0x2
#define _B5DLC_B5DLC2_SIZE                                  0x1
#define _B5DLC_B5DLC2_LENGTH                                0x1
#define _B5DLC_B5DLC2_MASK                                  0x4
#define _B5DLC_B5DLC3_POSN                                  0x3
#define _B5DLC_B5DLC3_POSITION                              0x3
#define _B5DLC_B5DLC3_SIZE                                  0x1
#define _B5DLC_B5DLC3_LENGTH                                0x1
#define _B5DLC_B5DLC3_MASK                                  0x8
#define _B5DLC_B5RB0_POSN                                   0x4
#define _B5DLC_B5RB0_POSITION                               0x4
#define _B5DLC_B5RB0_SIZE                                   0x1
#define _B5DLC_B5RB0_LENGTH                                 0x1
#define _B5DLC_B5RB0_MASK                                   0x10
#define _B5DLC_B5RB1_POSN                                   0x5
#define _B5DLC_B5RB1_POSITION                               0x5
#define _B5DLC_B5RB1_SIZE                                   0x1
#define _B5DLC_B5RB1_LENGTH                                 0x1
#define _B5DLC_B5RB1_MASK                                   0x20
#define _B5DLC_B5RXRTR_POSN                                 0x6
#define _B5DLC_B5RXRTR_POSITION                             0x6
#define _B5DLC_B5RXRTR_SIZE                                 0x1
#define _B5DLC_B5RXRTR_LENGTH                               0x1
#define _B5DLC_B5RXRTR_MASK                                 0x40

// Register: B5D0
#define B5D0 B5D0
extern volatile unsigned char           B5D0                __at(0xE76);
#ifndef _LIB_BUILD
asm("B5D0 equ 0E76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D00                  :1;
        unsigned B5D01                  :1;
        unsigned B5D02                  :1;
        unsigned B5D03                  :1;
        unsigned B5D04                  :1;
        unsigned B5D05                  :1;
        unsigned B5D06                  :1;
        unsigned B5D07                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned B57D07                 :1;
    };
} B5D0bits_t;
extern volatile B5D0bits_t B5D0bits __at(0xE76);
// bitfield macros
#define _B5D0_B5D00_POSN                                    0x0
#define _B5D0_B5D00_POSITION                                0x0
#define _B5D0_B5D00_SIZE                                    0x1
#define _B5D0_B5D00_LENGTH                                  0x1
#define _B5D0_B5D00_MASK                                    0x1
#define _B5D0_B5D01_POSN                                    0x1
#define _B5D0_B5D01_POSITION                                0x1
#define _B5D0_B5D01_SIZE                                    0x1
#define _B5D0_B5D01_LENGTH                                  0x1
#define _B5D0_B5D01_MASK                                    0x2
#define _B5D0_B5D02_POSN                                    0x2
#define _B5D0_B5D02_POSITION                                0x2
#define _B5D0_B5D02_SIZE                                    0x1
#define _B5D0_B5D02_LENGTH                                  0x1
#define _B5D0_B5D02_MASK                                    0x4
#define _B5D0_B5D03_POSN                                    0x3
#define _B5D0_B5D03_POSITION                                0x3
#define _B5D0_B5D03_SIZE                                    0x1
#define _B5D0_B5D03_LENGTH                                  0x1
#define _B5D0_B5D03_MASK                                    0x8
#define _B5D0_B5D04_POSN                                    0x4
#define _B5D0_B5D04_POSITION                                0x4
#define _B5D0_B5D04_SIZE                                    0x1
#define _B5D0_B5D04_LENGTH                                  0x1
#define _B5D0_B5D04_MASK                                    0x10
#define _B5D0_B5D05_POSN                                    0x5
#define _B5D0_B5D05_POSITION                                0x5
#define _B5D0_B5D05_SIZE                                    0x1
#define _B5D0_B5D05_LENGTH                                  0x1
#define _B5D0_B5D05_MASK                                    0x20
#define _B5D0_B5D06_POSN                                    0x6
#define _B5D0_B5D06_POSITION                                0x6
#define _B5D0_B5D06_SIZE                                    0x1
#define _B5D0_B5D06_LENGTH                                  0x1
#define _B5D0_B5D06_MASK                                    0x40
#define _B5D0_B5D07_POSN                                    0x7
#define _B5D0_B5D07_POSITION                                0x7
#define _B5D0_B5D07_SIZE                                    0x1
#define _B5D0_B5D07_LENGTH                                  0x1
#define _B5D0_B5D07_MASK                                    0x80
#define _B5D0_B57D07_POSN                                   0x7
#define _B5D0_B57D07_POSITION                               0x7
#define _B5D0_B57D07_SIZE                                   0x1
#define _B5D0_B57D07_LENGTH                                 0x1
#define _B5D0_B57D07_MASK                                   0x80

// Register: B5D1
#define B5D1 B5D1
extern volatile unsigned char           B5D1                __at(0xE77);
#ifndef _LIB_BUILD
asm("B5D1 equ 0E77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D10                  :1;
        unsigned B5D11                  :1;
        unsigned B5D12                  :1;
        unsigned B5D13                  :1;
        unsigned B5D14                  :1;
        unsigned B5D15                  :1;
        unsigned B5D16                  :1;
        unsigned B5D17                  :1;
    };
} B5D1bits_t;
extern volatile B5D1bits_t B5D1bits __at(0xE77);
// bitfield macros
#define _B5D1_B5D10_POSN                                    0x0
#define _B5D1_B5D10_POSITION                                0x0
#define _B5D1_B5D10_SIZE                                    0x1
#define _B5D1_B5D10_LENGTH                                  0x1
#define _B5D1_B5D10_MASK                                    0x1
#define _B5D1_B5D11_POSN                                    0x1
#define _B5D1_B5D11_POSITION                                0x1
#define _B5D1_B5D11_SIZE                                    0x1
#define _B5D1_B5D11_LENGTH                                  0x1
#define _B5D1_B5D11_MASK                                    0x2
#define _B5D1_B5D12_POSN                                    0x2
#define _B5D1_B5D12_POSITION                                0x2
#define _B5D1_B5D12_SIZE                                    0x1
#define _B5D1_B5D12_LENGTH                                  0x1
#define _B5D1_B5D12_MASK                                    0x4
#define _B5D1_B5D13_POSN                                    0x3
#define _B5D1_B5D13_POSITION                                0x3
#define _B5D1_B5D13_SIZE                                    0x1
#define _B5D1_B5D13_LENGTH                                  0x1
#define _B5D1_B5D13_MASK                                    0x8
#define _B5D1_B5D14_POSN                                    0x4
#define _B5D1_B5D14_POSITION                                0x4
#define _B5D1_B5D14_SIZE                                    0x1
#define _B5D1_B5D14_LENGTH                                  0x1
#define _B5D1_B5D14_MASK                                    0x10
#define _B5D1_B5D15_POSN                                    0x5
#define _B5D1_B5D15_POSITION                                0x5
#define _B5D1_B5D15_SIZE                                    0x1
#define _B5D1_B5D15_LENGTH                                  0x1
#define _B5D1_B5D15_MASK                                    0x20
#define _B5D1_B5D16_POSN                                    0x6
#define _B5D1_B5D16_POSITION                                0x6
#define _B5D1_B5D16_SIZE                                    0x1
#define _B5D1_B5D16_LENGTH                                  0x1
#define _B5D1_B5D16_MASK                                    0x40
#define _B5D1_B5D17_POSN                                    0x7
#define _B5D1_B5D17_POSITION                                0x7
#define _B5D1_B5D17_SIZE                                    0x1
#define _B5D1_B5D17_LENGTH                                  0x1
#define _B5D1_B5D17_MASK                                    0x80

